routes/web.php

    return view('/fitur/categories', [
        'title' => 'Categories',
        'active' => 'categories',
        'categories' =>  Category::all(),
---
SELECT * FROM `categories`