app/Http/Controllers/AdminCategoryController.php

SELECT * FROM `categories`
---
    public function index()
    {
        return view('dashboard.categories.index', [
            'title' => 'Admin Category',
            'categories' => Category::all()