app/Http/Controllers/DashboardPostController.php

SELECT * FROM `posts` WHERE `user_id` = '1'
---
    public function index()
    {
        return view('dashboard.posts.index', [
            'title' => 'MyPosts',
            'posts' => Post::where('user_id', auth()->user()->id)->get()

SELECT * FROM `categories`
---
    public function create()
    {
        return view('dashboard.posts.create', [
            'title' => 'Create Posts',
            'categories' => Category::all()

INSERT INTO `posts` (`title`, `slug`, `category_id`, `image`, `source`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) VALUES ('Laravel 8', 'laravel-8', '1', 'post-images/tq1DZJV6El64OUDil6SoZ0emSPJjFvjlS3uUxkax.png', 'Bagas', '<div>Coba Laravel 8</div>', '1', 'Coba Laravel 8', '2021-10-13 03:46:34', '2021-10-13 03:46:34')
---
    public function store(Request $request)
    {

        $validateData = $request->validate([
            'title' => 'required|max:255',
            'slug' => 'required|unique:posts',
            'category_id' => 'required',
            'image' => 'image|file|max:5120',
            'source' => 'max:30',
            'body' => 'required'
        ]);

        if ($request->file('image')) {
            $validateData['image'] = $request->file('image')->store('post-images');
        }

        $validateData['user_id'] = auth()->user()->id;
        $validateData['excerpt'] = Str::limit(strip_tags($request->body), 200);

        Post::create($validateData);

SELECT * FROM `categories`
---
    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'title' => 'Edit Posts',
            'categories' => Category::all(),