app/Http/Controllers/HomeDashboardController.php

    public function index()
    {
        // DB::table('posts')->count();
        $UserPost = Post::where('user_id', auth()->user()->id)->get()->count();
        $AllPost = DB::table('posts')->count();
        $TotalUsers = DB::table('users')->count();
---
SELECT * FROM `posts` WHERE `user_id` IS NULL
SELECT count(*) as aggregate FROM `posts`
SELECT count(*) as aggregate FROM `users`