app/Http/Controllers/PostController.php

    public function index()
    {
        $title = '';

        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in ' . $category->name;
        }

        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' by ' . $author->name;
        }

        return view('/fitur/posting', [
            "title" => "Posting" . $title,
            "active" => "posting",
            "posts" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(7)->withQueryString()
---
SELECT * FROM `categories` WHERE `slug` = 'cat' LIMIT 1
SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT count(*) as aggregate FROM `posts`